[
  {
    "id": "opcenito",
    "title": "Općenito",
    "items": [
      {
        "q": "Što je {site}?",
        "a": "{site} je marketplace za mini web‑aplikacije i igre. Možeš ih pokretati u pregledniku, lajkati i dijeliti, a kao kreator možeš ih objaviti u par minuta."
      },
      {
        "q": "Moram li imati račun?",
        "a": "Za pregled nije potrebno, ali za igranje/pokretanje, lajkove i objavu aplikacija potrebno je prijaviti se ili registrirati."
      },
      {
        "q": "Je li {site} besplatan?",
        "a": "Osnovno korištenje je besplatno. Napredne značajke i veće kvote dostupne su u Pro planu."
      }
    ]
  },
  {
    "id": "racun-privatnost",
    "title": "Račun i privatnost",
    "items": [
      {
        "q": "Kako se prijavljujem?",
        "a": "Prijava je preko Google računa ili email + lozinka. Nakon prijave automatski kreiramo korisnički profil za sinkronizaciju."
      },
      {
        "q": "Kako brišem račun?",
        "a": "Javi nam se preko podrške ili nas kontaktiraj putem profila – možemo trajno obrisati tvoj račun i pripadajuće podatke."
      },
      {
        "q": "Što spremate o meni?",
        "a": "Spremamo osnovne podatke potrebne za prijavu (email, ime, avatar) i agregirane metrike (lajkovi, pregledi). Ne prodajemo podatke trećim stranama."
      }
    ]
  },
  {
    "id": "objava-kreatori",
    "title": "Objava i kreatori",
    "items": [
      {
        "q": "Kako objavim aplikaciju?",
        "a": "Na naslovnici klikni ‘Publish App’, učitaj ZIP bundle ili repo i slijedi korake. Dobit ćeš pregled, mrežnu politiku i mogućnost dodavanja opisa, tagova i cijene."
      },
      {
        "q": "Zašto je moja aplikacija na ‘pending review’?",
        "a": "Aplikacije prolaze sigurnosnu provjeru (automatizirano + po potrebi ručno). Ako nešto treba popraviti, dobit ćeš obavijest i razloge."
      },
      {
        "q": "Mogu li naplatiti pristup aplikaciji?",
        "a": "Da. U detaljima aplikacije postavi cijenu. Korisnici s plaćenim pristupom ili PIN‑om moći će pokretati aplikaciju."
      },
      {
        "q": "Kako napraviti aplikaciju za više korisnika (sobe, sesije)?",
        "a": "Za dijeljenje podataka između korisnika, omogućite \"Thesara Storage\" pri objavi. U svom projektu koristite naš `@thesara/client` library i pozovite `initializeThesara()` na početku. Ta funkcija će vam vratiti `storage` objekt s asinkronim metodama `getItem`, `setItem` i `removeItem`. Ako host odmah injektira globalni `window.thesara.storage` s tim metodama, SDK ga automatski prepoznaje; inače se koristi postMessage handshake radi kompatibilnosti. U uputama za LLM navedite da koristi `await storage.getItem(...)` nakon inicijalizacije."
        
      }
    ]
  },
  {
    "id": "cijene-pretplate",
    "title": "Cijene i pretplate",
    "items": [
      {
        "q": "Koje planove nudite?",
        "a": "Free plan (do 2 aplikacije) i Gold plan s proširenim kvotama i dodatnim mogućnostima (npr. veći upload, prioritetni review)."
      },
      {
        "q": "Kako funkcioniraju plaćene aplikacije?",
        "a": "Kreator postavlja cijenu. Korisnik nakon plaćanja dobiva pristup (PIN ili entitlement) i može igrati/pokrenuti aplikaciju bez ograničenja."
      },
      {
        "q": "Povrat novca?",
        "a": "Ako nešto ne radi kako treba, kontaktiraj podršku u roku 14 dana i pomoći ćemo – uključujući povrat u opravdanim slučajevima."
      }
    ]
  },
  {
    "id": "ambasador-program",
    "title": "Ambasador Program",
    "items": [
      {
        "q": "Što je Thesara Ambasador program?",
        "a": "To je naš partnerski program za kreatore sadržaja, influencere i sve entuzijaste koji žele promovirati {site}. Kao ambasador, dobivaš jedinstveni promotivni kod koji tvojim pratiteljima daje posebnu pogodnost, na primjer mjesec dana besplatnog Gold plana."
      },
      {
        "q": "Kako mogu postati ambasador?",
        "a": "U postavkama svog profila pronaći ćeš opciju za prijavu u Ambasador program. Potrebno je ispuniti kratku prijavnicu s linkovima na tvoje profile (npr. TikTok, YouTube). Nakon što pregledamo prijavu, dobit ćeš obavijest i svoj jedinstveni kod ako je prijava odobrena."
      },
      {
        "q": "Kako i koliko mogu zaraditi?",
        "a": "Za svakog korisnika koji iskoristi tvoj kod i nakon toga postane plaćeni pretplatnik na Gold plan, dobivaš proviziju. Iznos provizije je postotak od prve uplate tog korisnika. Svi detalji o iznosu provizije i uvjetima dostupni su na tvom Ambasador Dashboardu nakon odobrenja."
      },
      {
        "q": "Kada i kako se vrše isplate?",
        "a": "Isplate se obrađuju jednom mjesečno, nakon što tvoja zarađena provizija dosegne minimalni prag za isplatu (npr. 50 EUR). Trenutno podržavamo isplate putem PayPala. Sve svoje zarade i status isplata možeš pratiti na svom dashboardu."
      },
      {
        "q": "Gdje mogu pratiti svoju uspješnost?",
        "a": "Nakon što postaneš ambasador, u svom profilu ćeš dobiti pristup posebnom 'Ambasador Dashboardu'. Tamo možeš u stvarnom vremenu pratiti broj iskorištenja koda, broj konverzija u plaćene korisnike i svoju ukupnu zaradu."
      }
    ]
  },
  {
    "id": "sigurnost",
    "title": "Sigurnost i sandbox",
    "items": [
      {
        "q": "Što je ‘sigurnosni kavez’?",
        "a": "Aplikacije se pokreću u sandboxiranom iframeu uz strogi CSP. Time ograničavamo pristup mreži, kolačićima i API‑jima preglednika."
      },
      {
        "q": "Što je mrežna politika (No Net / Media Only / Open Net)?",
        "a": "No Net: bez mrežnih poziva. Media Only: samo slike/CDN. Open Net: širi pristup (uz navođenje domena). Politika je vidljiva na detaljima aplikacije."
      },
      {
        "q": "Kako prijaviti problem ili zloupotrebu?",
        "a": "Na detaljima aplikacije koristite ‘Report’ (ako je vidljivo) ili nam pošaljite URL i opis putem podrške."
      }
    ]
  },
  {
    "id": "kompatibilnost",
    "title": "Kompatibilnost i performanse",
    "items": [
      {
        "q": "Koji preglednici su podržani?",
        "a": "Najbolje rade najnovije verzije Chrome, Edge, Safari i Firefox. Na mobilnim uređajima preporučujemo Chrome (Android) i Safari (iOS)."
      },
      {
        "q": "Aplikacija se sporo učitava – što učiniti?",
        "a": "Provjeri mrežnu vezu i pokušaj ponovo. Ako i dalje traje, javi kreatoru preko komentara ili podršci uz URL aplikacije."
      }
    ]
  },
  {
    "id": "pomoc",
    "title": "Pomoć i podrška",
    "items": [
      {
        "q": "Kako kontaktirati podršku?",
        "a": "Piši nam putem stranice podrške ili preko profila. Uključi URL aplikacije i kratki opis problema."
      },
      {
        "q": "Gdje su novosti i planovi?",
        "a": "Objavljujemo novosti u aplikaciji i na našim kanalima – potraži ‘Changelog’ u meniju ili nas prati na društvenim mrežama."
      }
    ]
  }
]
