[
  {
    "id": "grundlegend",
    "title": "Über",
    "items": [
      {
        "q": "Was ist Thesara?",
        "a": "Thesara ist eine Plattform, um Apps schnell und einfach mit wenigen Klicks zu veröffentlichen. Der Fokus liegt darauf, deine App weltweit verfügbar zu machen und deiner Kreativität einen Ort zum Parken zu geben."
      },
      {
        "q": "Welche Apps kann ich veröffentlichen?",
        "a": "Alle Apps, die in einem respektvollen Rahmen bleiben — keine Beleidigungen, Betrug, Diebstahl oder Lügen. Technisch gesehen funktionieren bei uns auch Apps, die du mit LLMs (z. B. ChatGPT) erstellt hast."
      }
    ]
  },
  {
    "id": "veroeffentlichung",
    "title": "Veröffentlichung",
    "items": [
      {
        "q": "Wie veröffentliche ich eine App?",
        "a": "Klicke auf den grünen 'Publish App' Button, füge den Code ein, den du aus ChatGPT oder einem anderen LLM kopiert hast, oder lade das Bundle hoch. Füge Titel, Beschreibung und ein Bild hinzu und veröffentliche. Danach wartest du auf unsere Prüfung und Freigabe."
      },
      {
        "q": "Wie lange dauert die Veröffentlichung?",
        "a": "Die Veröffentlichung kann von ein paar Minuten bis zu ein paar Stunden dauern. Wir arbeiten daran, alles zu beschleunigen — wir sind noch jung und verbessern uns stetig."
      },
      {
        "q": "Was, wenn die Veröffentlichung fehlschlägt?",
        "a": "Eine Veröffentlichung schlägt nur fehl, wenn wir die App ablehnen — du erhältst dann eine Benachrichtigung. Ist die App veröffentlicht, aber funktioniert nicht wie erwartet, nutze den Button 'Report Problem' in den App‑Details. Wir prüfen das dann."
      }
    ]
  },
  {
    "id": "speicherung",
    "title": "Speicherung & Upload",
    "items": [
      {
        "q": "Wo werden meine Builds und Uploads gespeichert?",
        "a": "Builds werden im Thesara‑System gespeichert. Bewahre trotzdem deine Originale auf — wir übernehmen keine Verantwortung für Backups oder dauerhafte Speicherung deiner Apps."
      },
      {
        "q": "Was tun, wenn ein Upload fehlschlägt?",
        "a": "Wenn ein Upload fehlschlägt, schreibe bitte an reports@thesara.space und wir prüfen den Vorfall. Uploads sollten normalerweise erfolgreich sein."
      }
    ]
  },
  {
    "id": "nutzung",
    "title": "Nutzung von Apps",
    "items": [
      {
        "q": "Wie kann ich meine App nutzen?",
        "a": "Du kannst eine App privat halten oder für alle freigeben. Du kannst sie kostenlos anbieten oder einen monatlichen Preis festlegen — für einzelne Apps oder dein gesamtes Repository. Andere Nutzer können für einen Preis auf alles zugreifen, was du veröffentlichst. Wir behalten 30% Provision; Details stehen in den AGB im Footer."
      },
      {
        "q": "Wann kann ich Einnahmen auszahlen lassen?",
        "a": "Sobald du mindestens 50 USD auf deinem Konto hast, kannst du eine Auszahlung anfordern. Transaktionsgebühren hängen vom gewählten Auszahlungsdienst ab und werden im Auszahlungsprozess angezeigt."
      }
    ]
  },
  {
    "id": "support",
    "title": "Vorschläge & Support",
    "items": [
      {
        "q": "Wie kann ich einen Vorschlag senden?",
        "a": "Nutze den Link 'Your suggestions' auf der Startseite — klicke und sende uns deine Ideen. Wir lieben Vorschläge, besonders solche, die Thesara verbessern!"
      },
      {
        "q": "Wo finde ich weitere Anleitungen?",
        "a": "Weitere Informationen findest du in diesem FAQ ili per Kontakt an support@thesara.space."
      }
    ]
  },
  {
    "id": "ambassador",
    "title": "Ambassador Programm",
    "items": [
      {
        "q": "Was ist das Ambassador Programm?",
        "a": "Ein kurzes Programm für Enthusiasten, die Thesara promoten möchten. Melde dich über das Formular im UI an und werde Teil des Teams, das die Zukunft der Kreativität gestaltet!"
      }
    ]
  }
]
