[
  {
    "id": "osnovno",
    "title": "Osnovno",
    "items": [
      {
        "q": "Što je Thesara?",
        "a": "Thesara je platforma za brzo i jednostavno objavljivanje aplikacija u par klikova. Fokus je na dostupnosti tvoje aplikacije korisnicima iz cijelog svijeta i tvojoj kreativnosti koja napokon ima mjesto gdje se može parkirati."
      },
      {
        "q": "Koje sve aplikacije i kakve aplikacije mogu objaviti?",
        "a": "Sve koje ulaze u onaj pristojni okvir gdje ne vrijeđaš drugoga, ne varaš, ne kradeš i ne lažeš — ali tehnički gledano, sve aplikacije koje ti se vrte u LLM-ovima (kao što su ChatGPT i slični sustavi) će raditi i kod nas."
      }
    ]
  },
  {
    "id": "objava",
    "title": "Objavljivanje",
    "items": [
      {
        "q": "Kako objaviti aplikaciju?",
        "a": "Klikneš na zeleni gumb 'Objavi Aplikaciju', zalijepiš gotovi kod koji si kopirao iz ChatGPT-a ili nekog drugog LLM sustava, ili jednostavno uploadaš bundle koji si tamo skinuo. Dodaš naslov, opis, odabereš sliku i objaviš. Zatim samo pričekaš da pregledamo i odobrimo aplikaciju i to je to!"
      },
      {
        "q": "Koliko traje objava?",
        "a": "Objava traje od par minuta do par sati, ali brzo ćemo mi to — nadamo se! :) Još smo mladi pa tek razvijamo svoju tehnologiju, ali kako vrijeme prolazi, sve će ići brže i bolje!"
      },
      {
        "q": "Što napraviti ako objava zakaže?",
        "a": "Objava aplikacije može zakazati samo ako ti odbijemo aplikaciju — u tom slučaju dobit ćeš obavijest. Aplikacija može biti i objavljena, ali ne raditi kako si zamislio. Ako si već pokušao objaviti novu, ispravljenu verziju i siguran si da je problem na našoj strani, imaš gumb u detaljima aplikacije 'Prijavi Problem'. Tamo nam opiši što se događa i posvetit ćemo se tom problemu posebno."
      }
    ]
  },
  {
    "id": "pohrana",
    "title": "Pohrana i upload",
    "items": [
      {
        "q": "Gdje su pohranjeni moji buildovi i uploadi?",
        "a": "Buildovi su pohranjeni u Thesara sustavu, ali svakako čuvaj svoje originale jer mi ne odgovaramo za backup i trajno čuvanje tvojih aplikacija."
      },
      {
        "q": "Što učiniti ako upload ne prođe?",
        "a": "Onda smo i mi u problemu jer smo dosta uvjereni da bi upload trebao uvijek proći. Ako se to ipak dogodi, pošalji nam email na reports@thesara.space i provjerit ćemo što se dogodilo."
      }
    ]
  },
  {
    "id": "korištenje",
    "title": "Korištenje aplikacija",
    "items": [
      {
        "q": "Kako mogu koristiti svoju aplikaciju?",
        "a": "Aplikaciju možeš koristiti privatno ili ju možeš staviti na korištenje svim korisnicima. Možeš ju ponuditi besplatno ili odrediti mjesečnu cijenu — kako za pojedine aplikacije, tako i za cijeli tvoj repozitorij. To drugim korisnicima omogućava da za jednu cijenu koriste sve aplikacije koje si objavio. Mi uzimamo 30% provizije, ali sve detalje možeš pročitati u Termsima na dnu stranice (footer link)."
      },
      {
        "q": "Kada mogu isplatiti zarađena sredstva?",
        "a": "Kada sakupiš minimalno 50 USD na računu, odmah možeš zatražiti isplatu. Naravno, postoji transakcijska naknada koja ovisi o servisu koji odabereš za isplatu — ali sve će ti biti jasno prikazano tijekom procesa isplate, kao i kod drugih servisa."
      }
    ]
  },
  {
    "id": "podrska",
    "title": "Prijedlozi i podrška",
    "items": [
      {
        "q": "Kako vam mogu poslati prijedlog?",
        "a": "Na naslovnici se nalazi link 'Vaši prijedlozi' — klikni i pošalji nam što ti padne na pamet. Volimo ideje, pogotovo one koje pomognu da Thesara postane još bolja!"
      },
      {
        "q": "Gdje mogu pronaći dodatne upute?",
        "a": "Dodatne informacije možeš pronaći ovdje u FAQ-u ili nas kontaktirati direktno putem support@thesara.space."
      }
    ]
  },
  {
    "id": "ambasador",
    "title": "Ambassador program",
    "items": [
      {
        "q": "Što je Ambassador program?",
        "a": "Kratak program za entuzijaste koji žele promovirati Thesaru. Prijavi se putem obrasca u sučelju i postani dio tima koji gradi budućnost kreativnosti!"
      }
    ]
  },
  {
    "id": "opcenito",
    "title": "Općenito",
    "items": [
      {
        "q": "Što je {site}?",
        "a": "{site} je marketplace za mini web‑aplikacije i igre. Možeš ih pokretati u pregledniku, lajkati i dijeliti, a kao kreator možeš ih objaviti u par minuta."
      },
      {
        "q": "Moram li imati račun?",
        "a": "Za pregled nije potrebno, ali za igranje/pokretanje, lajkove i objavu aplikacija potrebno je prijaviti se ili registrirati."
      },
      {
        "q": "Je li {site} besplatan?",
        "a": "Osnovno korištenje je besplatno. Napredne značajke i veće kvote dostupne su u Pro planu."
      }
    ]
  },
  {
    "id": "racun-privatnost",
    "title": "Račun i privatnost",
    "items": [
      {
        "q": "Kako se prijavljujem?",
        "a": "Prijava je preko Google računa ili email + lozinka. Nakon prijave automatski kreiramo korisnički profil za sinkronizaciju."
      },
      {
        "q": "Kako brišem račun?",
        "a": "Javi nam se preko podrške ili nas kontaktiraj putem profila – možemo trajno obrisati tvoj račun i pripadajuće podatke."
      },
      {
        "q": "Što spremate o meni?",
        "a": "Spremamo osnovne podatke potrebne za prijavu (email, ime, avatar) i agregirane metrike (lajkovi, pregledi). Ne prodajemo podatke trećim stranama."
      }
    ]
  },
  {
    "id": "objava-kreatori",
    "title": "Objava i kreatori",
    "items": [
      {
        "q": "Kako objavim aplikaciju?",
        "a": "Na naslovnici klikni ‘Publish App’, učitaj ZIP bundle ili repo i slijedi korake. Dobit ćeš pregled, mrežnu politiku i mogućnost dodavanja opisa, tagova i cijene."
      },
      {
        "q": "Zašto je moja aplikacija na ‘pending review’?",
        "a": "Aplikacije prolaze sigurnosnu provjeru (automatizirano + po potrebi ručno). Ako nešto treba popraviti, dobit ćeš obavijest i razloge."
      },
      {
        "q": "Mogu li naplatiti pristup aplikaciji?",
        "a": "Da. U detaljima aplikacije postavi cijenu. Korisnici s plaćenim pristupom ili PIN‑om moći će pokretati aplikaciju."
      }
    ]
  },
  {
    "id": "cijene-pretplate",
    "title": "Cijene i pretplate",
    "items": [
      {
        "q": "Koje planove nudite?",
        "a": "Free plan (do 2 aplikacije) i Gold plan s proširenim kvotama i dodatnim mogućnostima (npr. veći upload, prioritetni review)."
      },
      {
        "q": "Kako funkcioniraju plaćene aplikacije?",
        "a": "Kreator postavlja cijenu. Korisnik nakon plaćanja dobiva pristup (PIN ili entitlement) i može igrati/pokrenuti aplikaciju bez ograničenja."
      },
      {
        "q": "Povrat novca?",
        "a": "Ako nešto ne radi kako treba, kontaktiraj podršku u roku 14 dana i pomoći ćemo – uključujući povrat u opravdanim slučajevima."
      }
    ]
  },
  {
    "id": "sigurnost",
    "title": "Sigurnost i sandbox",
    "items": [
      {
        "q": "Što je ‘sigurnosni kavez’?",
        "a": "Aplikacije se pokreću u sandboxiranom iframeu uz strogi CSP. Time ograničavamo pristup mreži, kolačićima i API‑jima preglednika."
      },
      {
        "q": "Što je mrežna politika (No Net / Media Only / Open Net)?",
        "a": "No Net: bez mrežnih poziva. Media Only: samo slike/CDN. Open Net: širi pristup (uz navođenje domena). Politika je vidljiva na detaljima aplikacije."
      },
      {
        "q": "Kako prijaviti problem ili zloupotrebu?",
        "a": "Na detaljima aplikacije koristite ‘Report’ (ako je vidljivo) ili nam pošaljite URL i opis putem podrške."
      }
    ]
  },
  {
    "id": "kompatibilnost",
    "title": "Kompatibilnost i performanse",
    "items": [
      {
        "q": "Koji preglednici su podržani?",
        "a": "Najbolje rade najnovije verzije Chrome, Edge, Safari i Firefox. Na mobilnim uređajima preporučujemo Chrome (Android) i Safari (iOS)."
      },
      {
        "q": "Aplikacija se sporo učitava – što učiniti?",
        "a": "Provjeri mrežnu vezu i pokušaj ponovo. Ako i dalje traje, javi kreatoru preko komentara ili podršci uz URL aplikacije."
      }
    ]
  },
  {
    "id": "pomoc",
    "title": "Pomoć i podrška",
    "items": [
      {
        "q": "Kako kontaktirati podršku?",
        "a": "Piši nam putem stranice podrške ili preko profila. Uključi URL aplikacije i kratki opis problema."
      },
      {
        "q": "Gdje su novosti i planovi?",
        "a": "Objavljujemo novosti u aplikaciji i na našim kanalima – potraži ‘Changelog’ u meniju ili nas prati na društvenim mrežama."
      }
    ]
  }
]
